TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/*@}*/ /* end of group CANFD0_MCAN */

/** @addtogroup CANFD0_MCANSS
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  __IO uint32_t PWREN;                             /* !< (@ 0x00006800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00006804) Reset Control */
       uint32_t RESERVED1[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00006814) Status Register */
       uint32_t RESERVED2[506];
  CANFD0_MCAN_Regs  MCAN;                              /* !< (@ 0x00007000) */
       uint32_t RESERVED3[65];
  CANFD0_TI_WRAPPER_Regs  TI_WRAPPER;                        /* !< (@ 0x00007200) */
} CANFD0_MCANSS_Regs;

/*@}*/ /* end of group CANFD0_MCANSS */

/** @addtogroup CANFD0
  @{
*/

typedef struct {
       uint32_t RESERVED0[6144];
  CANFD0_MCANSS_Regs  MCANSS;                            /* !< (@ 0x00006000) */
} CANFD0_Regs;

/*@}*/ /* end of group CANFD0 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* CANFD0 Register Control Bits
******************************************************************************/

/* CANFD0_IIDX Bits */
/* CANFD0_IIDX[STAT] Bits */
#define CANFD0_IIDX_STAT_OFS                     (0)                             /* !< STAT Offset */
#define CANFD0_IIDX_STAT_MASK                    ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define CANFD0_IIDX_STAT_NO_INTR                 ((uint32_t)0x00000000U)         /* !< No interrupt pending. */
#define CANFD0_IIDX_STAT_INTL0                   ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 interrupt
                                                                                    pending. */
#define CANFD0_IIDX_STAT_INTL1                   ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 interrupt
                                                                                    pending. */
#define CANFD0_IIDX_STAT_SEC                     ((uint32_t)0x00000003U)         /* !< Message RAM SEC (Single Error
                                                                                    Correction) interrupt pending. */
#define CANFD0_IIDX_STAT_DED                     ((uint32_t)0x00000004U)         /* !< Message RAM DED (Double Error
                                                                                    Detection)  interrupt pending. */
#define CANFD0_IIDX_STAT_EXT_TS_CNTR_OVFL        ((uint32_t)0x00000005U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt pending. */
#define CANFD0_IIDX_STAT_WAKEUP                  ((uint32_t)0x00000006U)         /* !< Clock Stop Wake Up interrupt
                                                                                    pending. */

/* CANFD0_IMASK Bits */
/* CANFD0_IMASK[INTL0] Bits */
#define CANFD0_IMASK_INTL0_OFS                   (0)                             /* !< INTL0 Offset */
#define CANFD0_IMASK_INTL0_MASK                  ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 mask. */
#define CANFD0_IMASK_INTL0_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_INTL0_SET                   ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* CANFD0_IMASK[INTL1] Bits */
#define CANFD0_IMASK_INTL1_OFS                   (1)                             /* !< INTL1 Offset */
#define CANFD0_IMASK_INTL1_MASK                  ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 mask. */
#define CANFD0_IMASK_INTL1_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_INTL1_SET                   ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* CANFD0_IMASK[SEC] Bits */
#define CANFD0_IMASK_SEC_OFS                     (2)                             /* !< SEC Offset */
#define CANFD0_IMASK_SEC_MASK                    ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt mask. */
#define CANFD0_IMASK_SEC_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_SEC_SET                     ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* CANFD0_IMASK[DED] Bits */
#define CANFD0_IMASK_DED_OFS                     (3)                             /* !< DED Offset */
#define CANFD0_IMASK_DED_MASK                    ((uint32_t)0x00000008U)         /* !< Massage RAM DED interrupt mask. */
#define CANFD0_IMASK_DED_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_DED_SET                     ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */
/* CANFD0_IMASK[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_IMASK_EXT_TS_CNTR_OVFL_OFS        (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_IMASK_EXT_TS_CNTR_OVFL_MASK       ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt mask. */
#define CANFD0_IMASK_EXT_TS_CNTR_OVFL_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_EXT_TS_CNTR_OVFL_SET        ((uint32_t)0x00000010U)         /* !< Set Interrrupt Mask */
/* CANFD0_IMASK[WAKEUP] Bits */
#define CANFD0_IMASK_WAKEUP_OFS                  (5)                             /* !< WAKEUP Offset */
#define CANFD0_IMASK_WAKEUP_MASK                 ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt mask. */
#define CANFD0_IMASK_WAKEUP_CLR                  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD0_IMASK_WAKEUP_SET                  ((uint32_t)0x00000020U)         /* !< Set Interrrupt Mask */

/* CANFD0_RIS Bits */
/* CANFD0_RIS[INTL0] Bits */
#define CANFD0_RIS_INTL0_OFS                     (0)                             /* !< INTL0 Offset */
#define CANFD0_RIS_INTL0_MASK                    ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0. */
#define CANFD0_RIS_INTL0_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_INTL0_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* CANFD0_RIS[INTL1] Bits */
#define CANFD0_RIS_INTL1_OFS                     (1)                             /* !< INTL1 Offset */
#define CANFD0_RIS_INTL1_MASK                    ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1. */
#define CANFD0_RIS_INTL1_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_INTL1_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* CANFD0_RIS[SEC] Bits */
#define CANFD0_RIS_SEC_OFS                       (2)                             /* !< SEC Offset */
#define CANFD0_RIS_SEC_MASK                      ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt. */
#define CANFD0_RIS_SEC_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_SEC_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* CANFD0_RIS[DED] Bits */
#define CANFD0_RIS_DED_OFS                       (3)                             /* !< DED Offset */
#define CANFD0_RIS_DED_MASK                      ((uint32_t)0x00000008U)         /* !< Message RAM DED interrupt. */
#define CANFD0_RIS_DED_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_DED_SET                       ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* CANFD0_RIS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_RIS_EXT_TS_CNTR_OVFL_OFS          (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_RIS_EXT_TS_CNTR_OVFL_MASK         ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt. */
#define CANFD0_RIS_EXT_TS_CNTR_OVFL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_EXT_TS_CNTR_OVFL_SET          ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* CANFD0_RIS[WAKEUP] Bits */
#define CANFD0_RIS_WAKEUP_OFS                    (5)                             /* !< WAKEUP Offset */
#define CANFD0_RIS_WAKEUP_MASK                   ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt. */
#define CANFD0_RIS_WAKEUP_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_RIS_WAKEUP_SET                    ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* CANFD0_MIS Bits */
/* CANFD0_MIS[INTL0] Bits */
#define CANFD0_MIS_INTL0_OFS                     (0)                             /* !< INTL0 Offset */
#define CANFD0_MIS_INTL0_MASK                    ((uint32_t)0x00000001U)         /* !< Masked MCAN Interrupt Line 0. */
#define CANFD0_MIS_INTL0_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_INTL0_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* CANFD0_MIS[INTL1] Bits */
#define CANFD0_MIS_INTL1_OFS                     (1)                             /* !< INTL1 Offset */
#define CANFD0_MIS_INTL1_MASK                    ((uint32_t)0x00000002U)         /* !< Masked MCAN Interrupt Line 1. */
#define CANFD0_MIS_INTL1_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_INTL1_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* CANFD0_MIS[SEC] Bits */
#define CANFD0_MIS_SEC_OFS                       (2)                             /* !< SEC Offset */
#define CANFD0_MIS_SEC_MASK                      ((uint32_t)0x00000004U)         /* !< Masked Message RAM SEC interrupt. */
#define CANFD0_MIS_SEC_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_SEC_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* CANFD0_MIS[DED] Bits */
#define CANFD0_MIS_DED_OFS                       (3)                             /* !< DED Offset */
#define CANFD0_MIS_DED_MASK                      ((uint32_t)0x00000008U)         /* !< Masked Message RAM DED interrupt. */
#define CANFD0_MIS_DED_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_DED_SET                       ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* CANFD0_MIS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_MIS_EXT_TS_CNTR_OVFL_OFS          (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_MIS_EXT_TS_CNTR_OVFL_MASK         ((uint32_t)0x00000010U)         /* !< Masked External Timestamp Counter
                                                                                    Overflow interrupt. */
#define CANFD0_MIS_EXT_TS_CNTR_OVFL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_EXT_TS_CNTR_OVFL_SET          ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* CANFD0_MIS[WAKEUP] Bits */
#define CANFD0_MIS_WAKEUP_OFS                    (5)                             /* !< WAKEUP Offset */
#define CANFD0_MIS_WAKEUP_MASK                   ((uint32_t)0x00000020U)         /* !< Masked Clock Stop Wake Up
                                                                                    interrupt. */
#define CANFD0_MIS_WAKEUP_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD0_MIS_WAKEUP_SET                    ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* CANFD0_ISET Bits */
/* CANFD0_ISET[INTL0] Bits */
#define CANFD0_ISET_INTL0_OFS                    (0)                             /* !< INTL0 Offset */
#define CANFD0_ISET_INTL0_MASK                   ((uint32_t)0x00000001U)         /* !< Set MCAN Interrupt Line 0. */
#define CANFD0_ISET_INTL0_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_INTL0_SET                    ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* CANFD0_ISET[INTL1] Bits */
#define CANFD0_ISET_INTL1_OFS                    (1)                             /* !< INTL1 Offset */
#define CANFD0_ISET_INTL1_MASK                   ((uint32_t)0x00000002U)         /* !< Set MCAN Interrupt Line 1. */
#define CANFD0_ISET_INTL1_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_INTL1_SET                    ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* CANFD0_ISET[SEC] Bits */
#define CANFD0_ISET_SEC_OFS                      (2)                             /* !< SEC Offset */
#define CANFD0_ISET_SEC_MASK                     ((uint32_t)0x00000004U)         /* !< Set Message RAM SEC interrupt. */
#define CANFD0_ISET_SEC_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_SEC_SET                      ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* CANFD0_ISET[DED] Bits */
#define CANFD0_ISET_DED_OFS                      (3)                             /* !< DED Offset */
#define CANFD0_ISET_DED_MASK                     ((uint32_t)0x00000008U)         /* !< Set Message RAM DED interrupt. */
#define CANFD0_ISET_DED_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_DED_SET                      ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* CANFD0_ISET[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_ISET_EXT_TS_CNTR_OVFL_OFS         (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_ISET_EXT_TS_CNTR_OVFL_MASK        ((uint32_t)0x00000010U)         /* !< Set External Timestamp Counter
                                                                                    Overflow interrupt. */
#define CANFD0_ISET_EXT_TS_CNTR_OVFL_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_EXT_TS_CNTR_OVFL_SET         ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* CANFD0_ISET[WAKEUP] Bits */
#define CANFD0_ISET_WAKEUP_OFS                   (5)                             /* !< WAKEUP Offset */
#define CANFD0_ISET_WAKEUP_MASK                  ((uint32_t)0x00000020U)         /* !< Set Clock Stop Wake Up interrupt. */
#define CANFD0_ISET_WAKEUP_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_ISET_WAKEUP_SET                   ((uint32_t)0x00000020U)         /* !< Set Interrupt */

