TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/* CANFD0_MCANERR_SEC_EOI Bits */
/* CANFD0_MCANERR_SEC_EOI[EOI_WR] Bits */
#define CANFD0_MCANERR_SEC_EOI_EOI_WR_OFS        (0)                             /* !< EOI_WR Offset */
#define CANFD0_MCANERR_SEC_EOI_EOI_WR_MASK       ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_SEC goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* CANFD0_MCANERR_SEC_STATUS Bits */
/* CANFD0_MCANERR_SEC_STATUS[MSGMEM_PEND] Bits */
#define CANFD0_MCANERR_SEC_STATUS_MSGMEM_PEND_OFS (0)                             /* !< MSGMEM_PEND Offset */
#define CANFD0_MCANERR_SEC_STATUS_MSGMEM_PEND_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    0  No SEC interrupt is pending   1
                                                                                    SEC interrupt is pending */

/* CANFD0_MCANERR_SEC_ENABLE_SET Bits */
/* CANFD0_MCANERR_SEC_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define CANFD0_MCANERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define CANFD0_MCANERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD0_MCANERR_SEC_ENABLE_CLR Bits */
/* CANFD0_MCANERR_SEC_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define CANFD0_MCANERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define CANFD0_MCANERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD0_MCANERR_DED_EOI Bits */
/* CANFD0_MCANERR_DED_EOI[EOI_WR] Bits */
#define CANFD0_MCANERR_DED_EOI_EOI_WR_OFS        (0)                             /* !< EOI_WR Offset */
#define CANFD0_MCANERR_DED_EOI_EOI_WR_MASK       ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_DED goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* CANFD0_MCANERR_DED_STATUS Bits */
/* CANFD0_MCANERR_DED_STATUS[MSGMEM_PEND] Bits */
#define CANFD0_MCANERR_DED_STATUS_MSGMEM_PEND_OFS (0)                             /* !< MSGMEM_PEND Offset */
#define CANFD0_MCANERR_DED_STATUS_MSGMEM_PEND_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    0  No DED interrupt is pending   1
                                                                                    DED interrupt is pending */

/* CANFD0_MCANERR_DED_ENABLE_SET Bits */
/* CANFD0_MCANERR_DED_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define CANFD0_MCANERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define CANFD0_MCANERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD0_MCANERR_DED_ENABLE_CLR Bits */
/* CANFD0_MCANERR_DED_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define CANFD0_MCANERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define CANFD0_MCANERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

