TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/* CANFD0_MCANERR_AGGR_ENABLE_SET Bits */
/* CANFD0_MCANERR_AGGR_ENABLE_SET[ENABLE_PARITY_SET] Bits */
#define CANFD0_MCANERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET_OFS (0)                             /* !< ENABLE_PARITY_SET Offset */
#define CANFD0_MCANERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to enable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* CANFD0_MCANERR_AGGR_ENABLE_SET[ENABLE_TIMEOUT_SET] Bits */
#define CANFD0_MCANERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_OFS (1)                             /* !< ENABLE_TIMEOUT_SET Offset */
#define CANFD0_MCANERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to enable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

/* CANFD0_MCANERR_AGGR_ENABLE_CLR Bits */
/* CANFD0_MCANERR_AGGR_ENABLE_CLR[ENABLE_PARITY_CLR] Bits */
#define CANFD0_MCANERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_OFS (0)                             /* !< ENABLE_PARITY_CLR Offset */
#define CANFD0_MCANERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to disable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* CANFD0_MCANERR_AGGR_ENABLE_CLR[ENABLE_TIMEOUT_CLR] Bits */
#define CANFD0_MCANERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_OFS (1)                             /* !< ENABLE_TIMEOUT_CLR Offset */
#define CANFD0_MCANERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to disable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

/* CANFD0_MCANERR_AGGR_STATUS_SET Bits */
/* CANFD0_MCANERR_AGGR_STATUS_SET[AGGR_PARITY_ERR] Bits */
#define CANFD0_MCANERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define CANFD0_MCANERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */
/* CANFD0_MCANERR_AGGR_STATUS_SET[SVBUS_TIMEOUT] Bits */
#define CANFD0_MCANERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_OFS (2)                             /* !< SVBUS_TIMEOUT Offset */
#define CANFD0_MCANERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_MASK ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */

/* CANFD0_MCANERR_AGGR_STATUS_CLR Bits */
/* CANFD0_MCANERR_AGGR_STATUS_CLR[AGGR_PARITY_ERR] Bits */
#define CANFD0_MCANERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define CANFD0_MCANERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */
/* CANFD0_MCANERR_AGGR_STATUS_CLR[SVBUS_TIMEOUT] Bits */
#define CANFD0_MCANERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_OFS (2)                             /* !< SVBUS_TIMEOUT Offset */
#define CANFD0_MCANERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_MASK ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */

/* CANFD0_MCANSS_PID Bits */
/* CANFD0_MCANSS_PID[MINOR] Bits */
#define CANFD0_MCANSS_PID_MINOR_OFS              (0)                             /* !< MINOR Offset */
#define CANFD0_MCANSS_PID_MINOR_MASK             ((uint32_t)0x0000003FU)         /* !< Minor Revision of the MCAN
                                                                                    Subsystem */
/* CANFD0_MCANSS_PID[MAJOR] Bits */
#define CANFD0_MCANSS_PID_MAJOR_OFS              (8)                             /* !< MAJOR Offset */
#define CANFD0_MCANSS_PID_MAJOR_MASK             ((uint32_t)0x00000700U)         /* !< Major Revision of the MCAN
                                                                                    Subsystem */
/* CANFD0_MCANSS_PID[MODULE_ID] Bits */
#define CANFD0_MCANSS_PID_MODULE_ID_OFS          (16)                            /* !< MODULE_ID Offset */
#define CANFD0_MCANSS_PID_MODULE_ID_MASK         ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* CANFD0_MCANSS_PID[SCHEME] Bits */
#define CANFD0_MCANSS_PID_SCHEME_OFS             (30)                            /* !< SCHEME Offset */
#define CANFD0_MCANSS_PID_SCHEME_MASK            ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

