TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/* CANFD0_MCANSS_CTRL Bits */
/* CANFD0_MCANSS_CTRL[DBGSUSP_FREE] Bits */
#define CANFD0_MCANSS_CTRL_DBGSUSP_FREE_OFS      (3)                             /* !< DBGSUSP_FREE Offset */
#define CANFD0_MCANSS_CTRL_DBGSUSP_FREE_MASK     ((uint32_t)0x00000008U)         /* !< Debug Suspend Free Bit. Enables
                                                                                    debug suspend.   0  Honor debug
                                                                                    suspend   1  Disregard debug suspend */
/* CANFD0_MCANSS_CTRL[WAKEUPREQEN] Bits */
#define CANFD0_MCANSS_CTRL_WAKEUPREQEN_OFS       (4)                             /* !< WAKEUPREQEN Offset */
#define CANFD0_MCANSS_CTRL_WAKEUPREQEN_MASK      ((uint32_t)0x00000010U)         /* !< Wakeup Request Enable. Enables the
                                                                                    MCANSS to wakeup on CAN RXD activity.
                                                                                    0  Disable wakeup request   1
                                                                                    Enables wakeup request */
/* CANFD0_MCANSS_CTRL[AUTOWAKEUP] Bits */
#define CANFD0_MCANSS_CTRL_AUTOWAKEUP_OFS        (5)                             /* !< AUTOWAKEUP Offset */
#define CANFD0_MCANSS_CTRL_AUTOWAKEUP_MASK       ((uint32_t)0x00000020U)         /* !< Automatic Wakeup Enable. Enables
                                                                                    the MCANSS to automatically clear the
                                                                                    MCAN CCCR.INIT bit, fully waking the
                                                                                    MCAN up, on an enabled wakeup
                                                                                    request.   0  Disable the automatic
                                                                                    write to CCCR.INIT   1  Enable the
                                                                                    automatic write to CCCR.INIT */
/* CANFD0_MCANSS_CTRL[EXT_TS_CNTR_EN] Bits */
#define CANFD0_MCANSS_CTRL_EXT_TS_CNTR_EN_OFS    (6)                             /* !< EXT_TS_CNTR_EN Offset */
#define CANFD0_MCANSS_CTRL_EXT_TS_CNTR_EN_MASK   ((uint32_t)0x00000040U)         /* !< External Timestamp Counter Enable.
                                                                                    0  External timestamp counter
                                                                                    disabled   1  External timestamp
                                                                                    counter enabled */

/* CANFD0_MCANSS_STAT Bits */
/* CANFD0_MCANSS_STAT[RESET] Bits */
#define CANFD0_MCANSS_STAT_RESET_OFS             (0)                             /* !< RESET Offset */
#define CANFD0_MCANSS_STAT_RESET_MASK            ((uint32_t)0x00000001U)         /* !< Soft Reset Status.   0  Not in
                                                                                    reset   1  Reset is in progress */
/* CANFD0_MCANSS_STAT[MEM_INIT_DONE] Bits */
#define CANFD0_MCANSS_STAT_MEM_INIT_DONE_OFS     (1)                             /* !< MEM_INIT_DONE Offset */
#define CANFD0_MCANSS_STAT_MEM_INIT_DONE_MASK    ((uint32_t)0x00000002U)         /* !< Memory Initialization Done.   0
                                                                                    Message RAM initialization is in
                                                                                    progress   1  Message RAM is
                                                                                    initialized for use */
/* CANFD0_MCANSS_STAT[ENABLE_FDOE] Bits */
#define CANFD0_MCANSS_STAT_ENABLE_FDOE_OFS       (2)                             /* !< ENABLE_FDOE Offset */
#define CANFD0_MCANSS_STAT_ENABLE_FDOE_MASK      ((uint32_t)0x00000004U)         /* !< Enable FD (Flexible Data-Rate)
                                                                                    Configuration Reflects the value of
                                                                                    mcanss_enable_fdoe configuration
                                                                                    port, -h = mcanss_enable_fdoe. */

/* CANFD0_MCANSS_ICS Bits */
/* CANFD0_MCANSS_ICS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_MCANSS_ICS_EXT_TS_CNTR_OVFL_OFS   (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_MCANSS_ICS_EXT_TS_CNTR_OVFL_MASK  ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status Clear. Reads always
                                                                                    return a 0.   0  Write of '0' has no
                                                                                    effect   1  Write of '1' clears the
                                                                                    MCANSS_IRS.EXT_TS_CNTR_OVFL bit */

/* CANFD0_MCANSS_IRS Bits */
/* CANFD0_MCANSS_IRS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD0_MCANSS_IRS_EXT_TS_CNTR_OVFL_OFS   (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD0_MCANSS_IRS_EXT_TS_CNTR_OVFL_MASK  ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status. This bit is set by
                                                                                    HW or by a SW write of '1'. To clear,
                                                                                    use the MCANSS_ICS.EXT_TS_CNTR_OVFL
                                                                                    bit.   0  External timestamp counter
                                                                                    has not overflowed   1  External
                                                                                    timestamp counter has overflowed
                                                                                    When this bit is set to '1' by HW or
                                                                                    SW, the
                                                                                    MCANSS_EXT_TS_UNSERVICED_INTR_CNTR
                                                                                    .EXT_TS_INTR_CNTR bit field will
                                                                                    increment by 1. */

