TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/* CANFD0_MCAN_TXBTIE Bits */
/* CANFD0_MCAN_TXBTIE[TIE0] Bits */
#define CANFD0_MCAN_TXBTIE_TIE0_OFS              (0)                             /* !< TIE0 Offset */
#define CANFD0_MCAN_TXBTIE_TIE0_MASK             ((uint32_t)0x00000001U)         /* !< Transmission Interrupt Enable 0.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE1] Bits */
#define CANFD0_MCAN_TXBTIE_TIE1_OFS              (1)                             /* !< TIE1 Offset */
#define CANFD0_MCAN_TXBTIE_TIE1_MASK             ((uint32_t)0x00000002U)         /* !< Transmission Interrupt Enable 1.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE2] Bits */
#define CANFD0_MCAN_TXBTIE_TIE2_OFS              (2)                             /* !< TIE2 Offset */
#define CANFD0_MCAN_TXBTIE_TIE2_MASK             ((uint32_t)0x00000004U)         /* !< Transmission Interrupt Enable 2.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE3] Bits */
#define CANFD0_MCAN_TXBTIE_TIE3_OFS              (3)                             /* !< TIE3 Offset */
#define CANFD0_MCAN_TXBTIE_TIE3_MASK             ((uint32_t)0x00000008U)         /* !< Transmission Interrupt Enable 3.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE4] Bits */
#define CANFD0_MCAN_TXBTIE_TIE4_OFS              (4)                             /* !< TIE4 Offset */
#define CANFD0_MCAN_TXBTIE_TIE4_MASK             ((uint32_t)0x00000010U)         /* !< Transmission Interrupt Enable 4.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE5] Bits */
#define CANFD0_MCAN_TXBTIE_TIE5_OFS              (5)                             /* !< TIE5 Offset */
#define CANFD0_MCAN_TXBTIE_TIE5_MASK             ((uint32_t)0x00000020U)         /* !< Transmission Interrupt Enable 5.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE6] Bits */
#define CANFD0_MCAN_TXBTIE_TIE6_OFS              (6)                             /* !< TIE6 Offset */
#define CANFD0_MCAN_TXBTIE_TIE6_MASK             ((uint32_t)0x00000040U)         /* !< Transmission Interrupt Enable 6.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE7] Bits */
#define CANFD0_MCAN_TXBTIE_TIE7_OFS              (7)                             /* !< TIE7 Offset */
#define CANFD0_MCAN_TXBTIE_TIE7_MASK             ((uint32_t)0x00000080U)         /* !< Transmission Interrupt Enable 7.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE8] Bits */
#define CANFD0_MCAN_TXBTIE_TIE8_OFS              (8)                             /* !< TIE8 Offset */
#define CANFD0_MCAN_TXBTIE_TIE8_MASK             ((uint32_t)0x00000100U)         /* !< Transmission Interrupt Enable 8.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE9] Bits */
#define CANFD0_MCAN_TXBTIE_TIE9_OFS              (9)                             /* !< TIE9 Offset */
#define CANFD0_MCAN_TXBTIE_TIE9_MASK             ((uint32_t)0x00000200U)         /* !< Transmission Interrupt Enable 9.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE10] Bits */
#define CANFD0_MCAN_TXBTIE_TIE10_OFS             (10)                            /* !< TIE10 Offset */
#define CANFD0_MCAN_TXBTIE_TIE10_MASK            ((uint32_t)0x00000400U)         /* !< Transmission Interrupt Enable 10.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE11] Bits */
#define CANFD0_MCAN_TXBTIE_TIE11_OFS             (11)                            /* !< TIE11 Offset */
#define CANFD0_MCAN_TXBTIE_TIE11_MASK            ((uint32_t)0x00000800U)         /* !< Transmission Interrupt Enable 11.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE12] Bits */
#define CANFD0_MCAN_TXBTIE_TIE12_OFS             (12)                            /* !< TIE12 Offset */
#define CANFD0_MCAN_TXBTIE_TIE12_MASK            ((uint32_t)0x00001000U)         /* !< Transmission Interrupt Enable 12.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE13] Bits */
#define CANFD0_MCAN_TXBTIE_TIE13_OFS             (13)                            /* !< TIE13 Offset */
#define CANFD0_MCAN_TXBTIE_TIE13_MASK            ((uint32_t)0x00002000U)         /* !< Transmission Interrupt Enable 13.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE14] Bits */
#define CANFD0_MCAN_TXBTIE_TIE14_OFS             (14)                            /* !< TIE14 Offset */
#define CANFD0_MCAN_TXBTIE_TIE14_MASK            ((uint32_t)0x00004000U)         /* !< Transmission Interrupt Enable 14.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE15] Bits */
#define CANFD0_MCAN_TXBTIE_TIE15_OFS             (15)                            /* !< TIE15 Offset */
#define CANFD0_MCAN_TXBTIE_TIE15_MASK            ((uint32_t)0x00008000U)         /* !< Transmission Interrupt Enable 15.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE16] Bits */
#define CANFD0_MCAN_TXBTIE_TIE16_OFS             (16)                            /* !< TIE16 Offset */
#define CANFD0_MCAN_TXBTIE_TIE16_MASK            ((uint32_t)0x00010000U)         /* !< Transmission Interrupt Enable 16.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE17] Bits */
#define CANFD0_MCAN_TXBTIE_TIE17_OFS             (17)                            /* !< TIE17 Offset */
#define CANFD0_MCAN_TXBTIE_TIE17_MASK            ((uint32_t)0x00020000U)         /* !< Transmission Interrupt Enable 17.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE18] Bits */
#define CANFD0_MCAN_TXBTIE_TIE18_OFS             (18)                            /* !< TIE18 Offset */
#define CANFD0_MCAN_TXBTIE_TIE18_MASK            ((uint32_t)0x00040000U)         /* !< Transmission Interrupt Enable 18.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE19] Bits */
#define CANFD0_MCAN_TXBTIE_TIE19_OFS             (19)                            /* !< TIE19 Offset */
#define CANFD0_MCAN_TXBTIE_TIE19_MASK            ((uint32_t)0x00080000U)         /* !< Transmission Interrupt Enable 19.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE20] Bits */
#define CANFD0_MCAN_TXBTIE_TIE20_OFS             (20)                            /* !< TIE20 Offset */
#define CANFD0_MCAN_TXBTIE_TIE20_MASK            ((uint32_t)0x00100000U)         /* !< Transmission Interrupt Enable 20.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE21] Bits */
#define CANFD0_MCAN_TXBTIE_TIE21_OFS             (21)                            /* !< TIE21 Offset */
#define CANFD0_MCAN_TXBTIE_TIE21_MASK            ((uint32_t)0x00200000U)         /* !< Transmission Interrupt Enable 21.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE22] Bits */
#define CANFD0_MCAN_TXBTIE_TIE22_OFS             (22)                            /* !< TIE22 Offset */
#define CANFD0_MCAN_TXBTIE_TIE22_MASK            ((uint32_t)0x00400000U)         /* !< Transmission Interrupt Enable 22.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE23] Bits */
#define CANFD0_MCAN_TXBTIE_TIE23_OFS             (23)                            /* !< TIE23 Offset */
#define CANFD0_MCAN_TXBTIE_TIE23_MASK            ((uint32_t)0x00800000U)         /* !< Transmission Interrupt Enable 23.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE24] Bits */
#define CANFD0_MCAN_TXBTIE_TIE24_OFS             (24)                            /* !< TIE24 Offset */
#define CANFD0_MCAN_TXBTIE_TIE24_MASK            ((uint32_t)0x01000000U)         /* !< Transmission Interrupt Enable 24.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE25] Bits */
#define CANFD0_MCAN_TXBTIE_TIE25_OFS             (25)                            /* !< TIE25 Offset */
#define CANFD0_MCAN_TXBTIE_TIE25_MASK            ((uint32_t)0x02000000U)         /* !< Transmission Interrupt Enable 25.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE26] Bits */
#define CANFD0_MCAN_TXBTIE_TIE26_OFS             (26)                            /* !< TIE26 Offset */
#define CANFD0_MCAN_TXBTIE_TIE26_MASK            ((uint32_t)0x04000000U)         /* !< Transmission Interrupt Enable 26.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE27] Bits */
#define CANFD0_MCAN_TXBTIE_TIE27_OFS             (27)                            /* !< TIE27 Offset */
#define CANFD0_MCAN_TXBTIE_TIE27_MASK            ((uint32_t)0x08000000U)         /* !< Transmission Interrupt Enable 27.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE28] Bits */
#define CANFD0_MCAN_TXBTIE_TIE28_OFS             (28)                            /* !< TIE28 Offset */
#define CANFD0_MCAN_TXBTIE_TIE28_MASK            ((uint32_t)0x10000000U)         /* !< Transmission Interrupt Enable 28.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE29] Bits */
#define CANFD0_MCAN_TXBTIE_TIE29_OFS             (29)                            /* !< TIE29 Offset */
#define CANFD0_MCAN_TXBTIE_TIE29_MASK            ((uint32_t)0x20000000U)         /* !< Transmission Interrupt Enable 29.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE30] Bits */
#define CANFD0_MCAN_TXBTIE_TIE30_OFS             (30)                            /* !< TIE30 Offset */
#define CANFD0_MCAN_TXBTIE_TIE30_MASK            ((uint32_t)0x40000000U)         /* !< Transmission Interrupt Enable 30.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */
/* CANFD0_MCAN_TXBTIE[TIE31] Bits */
#define CANFD0_MCAN_TXBTIE_TIE31_OFS             (31)                            /* !< TIE31 Offset */
#define CANFD0_MCAN_TXBTIE_TIE31_MASK            ((uint32_t)0x80000000U)         /* !< Transmission Interrupt Enable 31.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Interrupt Enable bit.
                                                                                    0  Transmission interrupt disabled
                                                                                    1  Transmission interrupt enable */

