TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE26] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE26_OFS            (26)                            /* !< CFIE26 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE26_MASK           ((uint32_t)0x04000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 26. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE27] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE27_OFS            (27)                            /* !< CFIE27 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE27_MASK           ((uint32_t)0x08000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 27. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE28] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE28_OFS            (28)                            /* !< CFIE28 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE28_MASK           ((uint32_t)0x10000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 28. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE29] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE29_OFS            (29)                            /* !< CFIE29 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE29_MASK           ((uint32_t)0x20000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 29. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE30] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE30_OFS            (30)                            /* !< CFIE30 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE30_MASK           ((uint32_t)0x40000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 30. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* CANFD0_MCAN_TXBCIE[CFIE31] Bits */
#define CANFD0_MCAN_TXBCIE_CFIE31_OFS            (31)                            /* !< CFIE31 Offset */
#define CANFD0_MCAN_TXBCIE_CFIE31_MASK           ((uint32_t)0x80000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 31. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */

