TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd0.h
/* CANFD0_MCAN_TXEFC Bits */
/* CANFD0_MCAN_TXEFC[EFSA] Bits */
#define CANFD0_MCAN_TXEFC_EFSA_OFS               (2)                             /* !< EFSA Offset */
#define CANFD0_MCAN_TXEFC_EFSA_MASK              ((uint32_t)0x0000FFFCU)         /* !< Event FIFO Start Address. Start
                                                                                    address of Tx Event FIFO in Message
                                                                                    RAM (32-bit word address). */
/* CANFD0_MCAN_TXEFC[EFS] Bits */
#define CANFD0_MCAN_TXEFC_EFS_OFS                (16)                            /* !< EFS Offset */
#define CANFD0_MCAN_TXEFC_EFS_MASK               ((uint32_t)0x003F0000U)         /* !< Event FIFO Size. The Tx Event FIFO
                                                                                    elements are indexed from 0 to EFS -
                                                                                    1.   0      Tx Event FIFO disabled
                                                                                    1-32  Number of Tx Event FIFO
                                                                                    elements   >32   Values greater than
                                                                                    32 are interpreted as 32 */
/* CANFD0_MCAN_TXEFC[EFWM] Bits */
#define CANFD0_MCAN_TXEFC_EFWM_OFS               (24)                            /* !< EFWM Offset */
#define CANFD0_MCAN_TXEFC_EFWM_MASK              ((uint32_t)0x3F000000U)         /* !< Event FIFO Watermark   0
                                                                                    Watermark interrupt disabled   1-32
                                                                                    Level for Tx Event FIFO watermark
                                                                                    interrupt (IR.TEFW)   >32   Watermark
                                                                                    interrupt disabled */

/* CANFD0_MCAN_TXEFS Bits */
/* CANFD0_MCAN_TXEFS[EFFL] Bits */
#define CANFD0_MCAN_TXEFS_EFFL_OFS               (0)                             /* !< EFFL Offset */
#define CANFD0_MCAN_TXEFS_EFFL_MASK              ((uint32_t)0x0000003FU)         /* !< Event FIFO Fill Level. Number of
                                                                                    elements stored in Tx Event FIFO,
                                                                                    range 0 to 32. */
/* CANFD0_MCAN_TXEFS[EFGI] Bits */
#define CANFD0_MCAN_TXEFS_EFGI_OFS               (8)                             /* !< EFGI Offset */
#define CANFD0_MCAN_TXEFS_EFGI_MASK              ((uint32_t)0x00001F00U)         /* !< Event FIFO Get Index. Tx Event FIFO
                                                                                    read index pointer, range 0 to 31. */
/* CANFD0_MCAN_TXEFS[EFPI] Bits */
#define CANFD0_MCAN_TXEFS_EFPI_OFS               (16)                            /* !< EFPI Offset */
#define CANFD0_MCAN_TXEFS_EFPI_MASK              ((uint32_t)0x001F0000U)         /* !< Event FIFO Put Index.Tx Event FIFO
                                                                                    write index pointer, range 0 to 31. */
/* CANFD0_MCAN_TXEFS[EFF] Bits */
#define CANFD0_MCAN_TXEFS_EFF_OFS                (24)                            /* !< EFF Offset */
#define CANFD0_MCAN_TXEFS_EFF_MASK               ((uint32_t)0x01000000U)         /* !< Event FIFO Full   0  Tx Event FIFO
                                                                                    not full   1  Tx Event FIFO full */
/* CANFD0_MCAN_TXEFS[TEFL] Bits */
#define CANFD0_MCAN_TXEFS_TEFL_OFS               (25)                            /* !< TEFL Offset */
#define CANFD0_MCAN_TXEFS_TEFL_MASK              ((uint32_t)0x02000000U)         /* !< Tx Event FIFO Element Lost. This
                                                                                    bit is a copy of interrupt flag
                                                                                    IR.TEFL. When IR.TEFL is reset, this
                                                                                    bit is also reset.   0  No Tx Event
                                                                                    FIFO element lost   1  Tx Event FIFO
                                                                                    element lost, also set after write
                                                                                    attempt to Tx Event FIFO of size
                                                                                    zero. */

/* CANFD0_MCAN_TXEFA Bits */
/* CANFD0_MCAN_TXEFA[EFAI] Bits */
#define CANFD0_MCAN_TXEFA_EFAI_OFS               (0)                             /* !< EFAI Offset */
#define CANFD0_MCAN_TXEFA_EFAI_MASK              ((uint32_t)0x0000001FU)         /* !< Event FIFO Acknowledge Index. After
                                                                                    the Host has read an element or a
                                                                                    sequence of elements from the Tx
                                                                                    Event FIFO it has to write the index
                                                                                    of the last element read from Tx
                                                                                    Event FIFO to EFAI. This will set the
                                                                                    Tx Event FIFO Get Index TXEFS.EFGI to
                                                                                    EFAI + 1 and update the Event FIFO
                                                                                    Fill Level TXEFS.EFFL. */

/* CANFD0_PWREN Bits */
/* CANFD0_PWREN[ENABLE] Bits */
#define CANFD0_PWREN_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define CANFD0_PWREN_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< Enable the power */
#define CANFD0_PWREN_ENABLE_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable Power */
#define CANFD0_PWREN_ENABLE_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable Power */
/* CANFD0_PWREN[KEY] Bits */
#define CANFD0_PWREN_KEY_OFS                     (24)                            /* !< KEY Offset */
#define CANFD0_PWREN_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define CANFD0_PWREN_KEY_UNLOCK_W                ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* CANFD0_RSTCTL Bits */
/* CANFD0_RSTCTL[RESETSTKYCLR] Bits */
#define CANFD0_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define CANFD0_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define CANFD0_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* CANFD0_RSTCTL[RESETASSERT] Bits */
#define CANFD0_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define CANFD0_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define CANFD0_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD0_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* CANFD0_RSTCTL[KEY] Bits */
#define CANFD0_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define CANFD0_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define CANFD0_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* CANFD0_STAT Bits */
/* CANFD0_STAT[RESETSTKY] Bits */
#define CANFD0_STAT_RESETSTKY_OFS                (16)                            /* !< RESETSTKY Offset */
#define CANFD0_STAT_RESETSTKY_MASK               ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define CANFD0_STAT_RESETSTKY_NORES              ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define CANFD0_STAT_RESETSTKY_RESET              ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_canfd0__include */

